---
permalink: snaplock/set-default-retention-period-task.html
sidebar: sidebar
keywords: snaplock, volume, command, modify, retention, period, file, set, default
summary: "You can use the volume snaplock modify command to set the default retention period for files on a SnapLock volume."
---
= Set the default retention period
:icons: font
:imagesdir: ../media/

[.lead]
You can use the `volume snaplock modify` command to set the default retention period for files on a SnapLock volume.

.What you'll need

The SnapLock volume must be online.

.About this task

The following table shows the possible values for the default retention period option:

[NOTE]
====
The default retention period must be greater than or equal to (>=) the minimum retention period and less than or equal to (\<=) the maximum retention period.
====

[options="header"]
|===
| Value| Unit| Notes
a|
0 - 65535
a|
seconds
a|

a|
0 - 24
a|
hours
a|

a|
0 - 365
a|
days
a|

a|
0 - 12
a|
months
a|

a|
0 - 100
a|
years
a|
Beginning with ONTAP 9.10.1. For earlier ONTAP releases, the value is 0 - 70.
a|
max
a|
-
a|
Use the maximum retention period.
a|
min
a|
-
a|
Use the minimum retention period.
a|
infinite
a|
-
a|
Retain the files forever.
a|
unspecified
a|
-
a|
Retain the files until an absolute retention period is set.
|===
The values and ranges for the maximum and minimum retention periods are identical, except for `max` and `min`, which are not applicable. For more information about this task, see link:set-retention-period-task.html[Set the retention time overview].

You can use the `volume snaplock show` command to view the retention period settings for the volume. For more information, see the man page for the command.

[NOTE]
====
After a file has been committed to the WORM state, you can extend but not shorten the retention period.
====

.Steps

. Set the default retention period for files on a SnapLock volume:
+
`*volume snaplock modify -vserver _SVM_name_ -volume _volume_name_ -default-retention-period _default_retention_period_ -minimum-retention-period _min_retention_period_ -maximum-retention-period _max_retention_period_*`
+
For a complete list of options, see the man page for the command.
+
[NOTE]
====
The following examples assume that the minimum and maximum retention periods have not been modified previously.
====
+
The following command sets the default retention period for a Compliance or Enterprise volume to 20 days:
+
----
cluster1::> volume snaplock modify -vserver vs1 -volume vol1 -default-retention-period 20days
----
+
The following command sets the default retention period for a Compliance volume to 70 years:
+
----
cluster1::> volume snaplock modify -vserver vs1 -volume vol1 -maximum-retention-period 70years
----
+
The following command sets the default retention period for an Enterprise volume to 10 years:
+
----
cluster1::> volume snaplock modify -vserver vs1 -volume vol1 -default-retention-period max -maximum-retention-period 10years
----
+
The following commands set the default retention period for an Enterprise volume to 10 days:
+
----
cluster1::> volume snaplock modify -vserver vs1 -volume vol1 -minimum-retention-period 10days
cluster1::> volume snaplock modify -vserver vs1 -volume vol1 -default-retention-period min
----
+
The following command sets the default retention period for a Compliance volume to infinite:
+
----
cluster1::> volume snaplock modify -vserver vs1 -volume vol1 -default-retention-period infinite -maximum-retention-period infinite
----

// 2022-7-22, issue 581 
