---
permalink: nfs-config/create-kerberos-config-task.html
sidebar: sidebar
keywords: enable, kerberos, data, lif
summary: "You can use the vserver nfs kerberos interface enable command to enable Kerberos on a data LIF. This enables the SVM to use Kerberos security services for NFS."
---
= Enable Kerberos on a data LIF
:icons: font
:imagesdir: ../media/

[.lead]
You can use the `vserver nfs kerberos interface enable` command to enable Kerberos on a data LIF. This enables the SVM to use Kerberos security services for NFS.

.About this task

If you are using an Active Directory KDC, the first 15 characters of any SPNs used must be unique across SVMs within a realm or domain.

.Steps

[role="tabbed-block"]
====
.Enable TLS using System Manager
--
.Steps

. Click *Storage > Storage VMs*, select the storage VM, and then click *Settings*.

. Click image:icon_arrow.gif[arrow icon] in the NFS tile and then click *NFS over TLS settings*.

. In the *NFS over TLS settings* area, select an NFS network interface for which you want to enable TLS. 
. Click the image:icon_kabob.gif[Options icon] for that interface.
. Click *Enable*.
. In the *Network interface TLS configuration* dialog, include a certificate for use with TLS by selecting one of the following options:
+
* *Installed certificate*: Choose a previously installed certificate from the drop-down list.
* *New certificate*: Choose a common name for the certificate.
* *External CA-signed certificate*: Follow the instructions to paste the contents of your certificate and private key into the boxes.
. Click *Save*.
--

.Enable TLS using the ONTAP CLI
--
.Steps

. Choose a storage VM and a logical interface (LIF) on which to enable TLS.
. Enable TLS for NFS connections on that storage VM and interface. Replace values in brackets <> with information from your environment:
+
[source,console]
----
vs1::> vserver nfs tls interface enable -vserver <STORAGE_VM> -lif <LIF_NAME> -certificate-name <CERTIFICATE_NAME>
----
. Use the `vserver nfs tls interface show` command to view the results:
+
[source,console]
----
vs1::> vserver nfs tls interface show
----
--
====

.Example

The following command enables TLS for NFS connections on the `data1` LIF of the `vs1` storage VM: 
[source,console]
----
vs1::> vserver nfs tls interface enable -vserver vs1 -lif data1 -certificate-name cert_vs1
----

[source,console]
----
vs1::> vserver nfs tls interface show
----
               Logical
Vserver        Interface     Address         TLS Status TLS Certificate Name
-------------- ------------- --------------- ---------- -----------------------
vs1           data1         10.0.1.1     enabled    cert_vs1
vs2           data2         10.0.1.2     disabled   -
2 entries were displayed.

